GopalSaraf/Practicals/PSDL/include/proc/pic18f15q40.h
extern volatile CLCnSEL2bits_t CLCnSEL2bits __at(0x0DA);
// bitfield macros
#define _CLCnSEL2_D3S_POSN                                  0x0
#define _CLCnSEL2_D3S_POSITION                              0x0
#define _CLCnSEL2_D3S_SIZE                                  0x8
#define _CLCnSEL2_D3S_LENGTH                                0x8
#define _CLCnSEL2_D3S_MASK                                  0xFF
#define _CLCnSEL2_D3S0_POSN                                 0x0
#define _CLCnSEL2_D3S0_POSITION                             0x0
#define _CLCnSEL2_D3S0_SIZE                                 0x1
#define _CLCnSEL2_D3S0_LENGTH                               0x1
#define _CLCnSEL2_D3S0_MASK                                 0x1
#define _CLCnSEL2_D3S1_POSN                                 0x1
#define _CLCnSEL2_D3S1_POSITION                             0x1
#define _CLCnSEL2_D3S1_SIZE                                 0x1
#define _CLCnSEL2_D3S1_LENGTH                               0x1
#define _CLCnSEL2_D3S1_MASK                                 0x2
#define _CLCnSEL2_D3S2_POSN                                 0x2
#define _CLCnSEL2_D3S2_POSITION                             0x2
#define _CLCnSEL2_D3S2_SIZE                                 0x1
#define _CLCnSEL2_D3S2_LENGTH                               0x1
#define _CLCnSEL2_D3S2_MASK                                 0x4
#define _CLCnSEL2_D3S3_POSN                                 0x3
#define _CLCnSEL2_D3S3_POSITION                             0x3
#define _CLCnSEL2_D3S3_SIZE                                 0x1
#define _CLCnSEL2_D3S3_LENGTH                               0x1
#define _CLCnSEL2_D3S3_MASK                                 0x8
#define _CLCnSEL2_D3S4_POSN                                 0x4
#define _CLCnSEL2_D3S4_POSITION                             0x4
#define _CLCnSEL2_D3S4_SIZE                                 0x1
#define _CLCnSEL2_D3S4_LENGTH                               0x1
#define _CLCnSEL2_D3S4_MASK                                 0x10
#define _CLCnSEL2_D3S5_POSN                                 0x5
#define _CLCnSEL2_D3S5_POSITION                             0x5
#define _CLCnSEL2_D3S5_SIZE                                 0x1
#define _CLCnSEL2_D3S5_LENGTH                               0x1
#define _CLCnSEL2_D3S5_MASK                                 0x20
#define _CLCnSEL2_D3S6_POSN                                 0x6
#define _CLCnSEL2_D3S6_POSITION                             0x6
#define _CLCnSEL2_D3S6_SIZE                                 0x1
#define _CLCnSEL2_D3S6_LENGTH                               0x1
#define _CLCnSEL2_D3S6_MASK                                 0x40

// Register: CLCnSEL3
#define CLCnSEL3 CLCnSEL3
extern volatile unsigned char           CLCnSEL3            __at(0x0DB);
#ifndef _LIB_BUILD
asm("CLCnSEL3 equ 0DBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D4S                    :8;
    };
    struct {
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
        unsigned D4S3                   :1;
        unsigned D4S4                   :1;
        unsigned D4S5                   :1;
        unsigned D4S6                   :1;
    };
} CLCnSEL3bits_t;
extern volatile CLCnSEL3bits_t CLCnSEL3bits __at(0x0DB);
// bitfield macros
#define _CLCnSEL3_D4S_POSN                                  0x0
#define _CLCnSEL3_D4S_POSITION                              0x0
#define _CLCnSEL3_D4S_SIZE                                  0x8
#define _CLCnSEL3_D4S_LENGTH                                0x8
#define _CLCnSEL3_D4S_MASK                                  0xFF
#define _CLCnSEL3_D4S0_POSN                                 0x0
#define _CLCnSEL3_D4S0_POSITION                             0x0
#define _CLCnSEL3_D4S0_SIZE                                 0x1
#define _CLCnSEL3_D4S0_LENGTH                               0x1
#define _CLCnSEL3_D4S0_MASK                                 0x1
#define _CLCnSEL3_D4S1_POSN                                 0x1
#define _CLCnSEL3_D4S1_POSITION                             0x1
#define _CLCnSEL3_D4S1_SIZE                                 0x1
#define _CLCnSEL3_D4S1_LENGTH                               0x1
#define _CLCnSEL3_D4S1_MASK                                 0x2
#define _CLCnSEL3_D4S2_POSN                                 0x2
#define _CLCnSEL3_D4S2_POSITION                             0x2
#define _CLCnSEL3_D4S2_SIZE                                 0x1
#define _CLCnSEL3_D4S2_LENGTH                               0x1
#define _CLCnSEL3_D4S2_MASK                                 0x4
#define _CLCnSEL3_D4S3_POSN                                 0x3
#define _CLCnSEL3_D4S3_POSITION                             0x3
#define _CLCnSEL3_D4S3_SIZE                                 0x1
#define _CLCnSEL3_D4S3_LENGTH                               0x1
#define _CLCnSEL3_D4S3_MASK                                 0x8
#define _CLCnSEL3_D4S4_POSN                                 0x4
#define _CLCnSEL3_D4S4_POSITION                             0x4
#define _CLCnSEL3_D4S4_SIZE                                 0x1
#define _CLCnSEL3_D4S4_LENGTH                               0x1
#define _CLCnSEL3_D4S4_MASK                                 0x10
#define _CLCnSEL3_D4S5_POSN                                 0x5
#define _CLCnSEL3_D4S5_POSITION                             0x5
#define _CLCnSEL3_D4S5_SIZE                                 0x1
#define _CLCnSEL3_D4S5_LENGTH                               0x1
#define _CLCnSEL3_D4S5_MASK                                 0x20
#define _CLCnSEL3_D4S6_POSN                                 0x6
#define _CLCnSEL3_D4S6_POSITION                             0x6
#define _CLCnSEL3_D4S6_SIZE                                 0x1
#define _CLCnSEL3_D4S6_LENGTH                               0x1
#define _CLCnSEL3_D4S6_MASK                                 0x40

// Register: CLCnGLS0
#define CLCnGLS0 CLCnGLS0
extern volatile unsigned char           CLCnGLS0            __at(0x0DC);
#ifndef _LIB_BUILD
asm("CLCnGLS0 equ 0DCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
} CLCnGLS0bits_t;
extern volatile CLCnGLS0bits_t CLCnGLS0bits __at(0x0DC);
// bitfield macros
#define _CLCnGLS0_G1D1N_POSN                                0x0
#define _CLCnGLS0_G1D1N_POSITION                            0x0
#define _CLCnGLS0_G1D1N_SIZE                                0x1
#define _CLCnGLS0_G1D1N_LENGTH                              0x1
#define _CLCnGLS0_G1D1N_MASK                                0x1
#define _CLCnGLS0_G1D1T_POSN                                0x1
#define _CLCnGLS0_G1D1T_POSITION                            0x1
#define _CLCnGLS0_G1D1T_SIZE                                0x1
#define _CLCnGLS0_G1D1T_LENGTH                              0x1
#define _CLCnGLS0_G1D1T_MASK                                0x2
#define _CLCnGLS0_G1D2N_POSN                                0x2
#define _CLCnGLS0_G1D2N_POSITION                            0x2
#define _CLCnGLS0_G1D2N_SIZE                                0x1
#define _CLCnGLS0_G1D2N_LENGTH                              0x1
#define _CLCnGLS0_G1D2N_MASK                                0x4
#define _CLCnGLS0_G1D2T_POSN                                0x3
#define _CLCnGLS0_G1D2T_POSITION                            0x3
#define _CLCnGLS0_G1D2T_SIZE                                0x1
#define _CLCnGLS0_G1D2T_LENGTH                              0x1
#define _CLCnGLS0_G1D2T_MASK                                0x8
#define _CLCnGLS0_G1D3N_POSN                                0x4
#define _CLCnGLS0_G1D3N_POSITION                            0x4
#define _CLCnGLS0_G1D3N_SIZE                                0x1
#define _CLCnGLS0_G1D3N_LENGTH                              0x1
#define _CLCnGLS0_G1D3N_MASK                                0x10
#define _CLCnGLS0_G1D3T_POSN                                0x5
#define _CLCnGLS0_G1D3T_POSITION                            0x5
#define _CLCnGLS0_G1D3T_SIZE                                0x1
#define _CLCnGLS0_G1D3T_LENGTH                              0x1
#define _CLCnGLS0_G1D3T_MASK                                0x20
#define _CLCnGLS0_G1D4N_POSN                                0x6
#define _CLCnGLS0_G1D4N_POSITION                            0x6
#define _CLCnGLS0_G1D4N_SIZE                                0x1
#define _CLCnGLS0_G1D4N_LENGTH                              0x1
#define _CLCnGLS0_G1D4N_MASK                                0x40
#define _CLCnGLS0_G1D4T_POSN                                0x7
#define _CLCnGLS0_G1D4T_POSITION                            0x7
#define _CLCnGLS0_G1D4T_SIZE                                0x1
#define _CLCnGLS0_G1D4T_LENGTH                              0x1
#define _CLCnGLS0_G1D4T_MASK                                0x80

