GopalSaraf/Practicals/PSDL/include/proc/pic18f15q40.h
extern volatile U2BRGHbits_t U2BRGHbits __at(0x2C2);
// bitfield macros
#define _U2BRGH_BRGH_POSN                                   0x0
#define _U2BRGH_BRGH_POSITION                               0x0
#define _U2BRGH_BRGH_SIZE                                   0x8
#define _U2BRGH_BRGH_LENGTH                                 0x8
#define _U2BRGH_BRGH_MASK                                   0xFF

// Register: U2FIFO
#define U2FIFO U2FIFO
extern volatile unsigned char           U2FIFO              __at(0x2C3);
#ifndef _LIB_BUILD
asm("U2FIFO equ 02C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U2RXBF                 :1;
        unsigned U2RXBE                 :1;
        unsigned U2XON                  :1;
        unsigned U2RXIDL                :1;
        unsigned U2TXBF                 :1;
        unsigned U2TXBE                 :1;
        unsigned U2STPMD                :1;
        unsigned U2TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U2RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U2FIFObits_t;
extern volatile U2FIFObits_t U2FIFObits __at(0x2C3);
// bitfield macros
#define _U2FIFO_RXBF_POSN                                   0x0
#define _U2FIFO_RXBF_POSITION                               0x0
#define _U2FIFO_RXBF_SIZE                                   0x1
#define _U2FIFO_RXBF_LENGTH                                 0x1
#define _U2FIFO_RXBF_MASK                                   0x1
#define _U2FIFO_RXBE_POSN                                   0x1
#define _U2FIFO_RXBE_POSITION                               0x1
#define _U2FIFO_RXBE_SIZE                                   0x1
#define _U2FIFO_RXBE_LENGTH                                 0x1
#define _U2FIFO_RXBE_MASK                                   0x2
#define _U2FIFO_XON_POSN                                    0x2
#define _U2FIFO_XON_POSITION                                0x2
#define _U2FIFO_XON_SIZE                                    0x1
#define _U2FIFO_XON_LENGTH                                  0x1
#define _U2FIFO_XON_MASK                                    0x4
#define _U2FIFO_RXIDL_POSN                                  0x3
#define _U2FIFO_RXIDL_POSITION                              0x3
#define _U2FIFO_RXIDL_SIZE                                  0x1
#define _U2FIFO_RXIDL_LENGTH                                0x1
#define _U2FIFO_RXIDL_MASK                                  0x8
#define _U2FIFO_TXBF_POSN                                   0x4
#define _U2FIFO_TXBF_POSITION                               0x4
#define _U2FIFO_TXBF_SIZE                                   0x1
#define _U2FIFO_TXBF_LENGTH                                 0x1
#define _U2FIFO_TXBF_MASK                                   0x10
#define _U2FIFO_TXBE_POSN                                   0x5
#define _U2FIFO_TXBE_POSITION                               0x5
#define _U2FIFO_TXBE_SIZE                                   0x1
#define _U2FIFO_TXBE_LENGTH                                 0x1
#define _U2FIFO_TXBE_MASK                                   0x20
#define _U2FIFO_STPMD_POSN                                  0x6
#define _U2FIFO_STPMD_POSITION                              0x6
#define _U2FIFO_STPMD_SIZE                                  0x1
#define _U2FIFO_STPMD_LENGTH                                0x1
#define _U2FIFO_STPMD_MASK                                  0x40
#define _U2FIFO_TXWRE_POSN                                  0x7
#define _U2FIFO_TXWRE_POSITION                              0x7
#define _U2FIFO_TXWRE_SIZE                                  0x1
#define _U2FIFO_TXWRE_LENGTH                                0x1
#define _U2FIFO_TXWRE_MASK                                  0x80
#define _U2FIFO_U2RXBF_POSN                                 0x0
#define _U2FIFO_U2RXBF_POSITION                             0x0
#define _U2FIFO_U2RXBF_SIZE                                 0x1
#define _U2FIFO_U2RXBF_LENGTH                               0x1
#define _U2FIFO_U2RXBF_MASK                                 0x1
#define _U2FIFO_U2RXBE_POSN                                 0x1
#define _U2FIFO_U2RXBE_POSITION                             0x1
#define _U2FIFO_U2RXBE_SIZE                                 0x1
#define _U2FIFO_U2RXBE_LENGTH                               0x1
#define _U2FIFO_U2RXBE_MASK                                 0x2
#define _U2FIFO_U2XON_POSN                                  0x2
#define _U2FIFO_U2XON_POSITION                              0x2
#define _U2FIFO_U2XON_SIZE                                  0x1
#define _U2FIFO_U2XON_LENGTH                                0x1
#define _U2FIFO_U2XON_MASK                                  0x4
#define _U2FIFO_U2RXIDL_POSN                                0x3
#define _U2FIFO_U2RXIDL_POSITION                            0x3
#define _U2FIFO_U2RXIDL_SIZE                                0x1
#define _U2FIFO_U2RXIDL_LENGTH                              0x1
#define _U2FIFO_U2RXIDL_MASK                                0x8
#define _U2FIFO_U2TXBF_POSN                                 0x4
#define _U2FIFO_U2TXBF_POSITION                             0x4
#define _U2FIFO_U2TXBF_SIZE                                 0x1
#define _U2FIFO_U2TXBF_LENGTH                               0x1
#define _U2FIFO_U2TXBF_MASK                                 0x10
#define _U2FIFO_U2TXBE_POSN                                 0x5
#define _U2FIFO_U2TXBE_POSITION                             0x5
#define _U2FIFO_U2TXBE_SIZE                                 0x1
#define _U2FIFO_U2TXBE_LENGTH                               0x1
#define _U2FIFO_U2TXBE_MASK                                 0x20
#define _U2FIFO_U2STPMD_POSN                                0x6
#define _U2FIFO_U2STPMD_POSITION                            0x6
#define _U2FIFO_U2STPMD_SIZE                                0x1
#define _U2FIFO_U2STPMD_LENGTH                              0x1
#define _U2FIFO_U2STPMD_MASK                                0x40
#define _U2FIFO_U2TXWRE_POSN                                0x7
#define _U2FIFO_U2TXWRE_POSITION                            0x7
#define _U2FIFO_U2TXWRE_SIZE                                0x1
#define _U2FIFO_U2TXWRE_LENGTH                              0x1
#define _U2FIFO_U2TXWRE_MASK                                0x80
#define _U2FIFO_U2RCIDL_POSN                                0x3
#define _U2FIFO_U2RCIDL_POSITION                            0x3
#define _U2FIFO_U2RCIDL_SIZE                                0x1
#define _U2FIFO_U2RCIDL_LENGTH                              0x1
#define _U2FIFO_U2RCIDL_MASK                                0x8
#define _U2FIFO_RCIDL_POSN                                  0x3
#define _U2FIFO_RCIDL_POSITION                              0x3
#define _U2FIFO_RCIDL_SIZE                                  0x1
#define _U2FIFO_RCIDL_LENGTH                                0x1
#define _U2FIFO_RCIDL_MASK                                  0x8

// Register: U2UIR
#define U2UIR U2UIR
extern volatile unsigned char           U2UIR               __at(0x2C4);
#ifndef _LIB_BUILD
asm("U2UIR equ 02C4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U2ABDIE                :1;
        unsigned                        :3;
        unsigned U2ABDIF                :1;
        unsigned U2WUIF                 :1;
    };
} U2UIRbits_t;
extern volatile U2UIRbits_t U2UIRbits __at(0x2C4);
// bitfield macros
#define _U2UIR_ABDIE_POSN                                   0x2
#define _U2UIR_ABDIE_POSITION                               0x2
#define _U2UIR_ABDIE_SIZE                                   0x1
#define _U2UIR_ABDIE_LENGTH                                 0x1
#define _U2UIR_ABDIE_MASK                                   0x4
#define _U2UIR_ABDIF_POSN                                   0x6
#define _U2UIR_ABDIF_POSITION                               0x6
#define _U2UIR_ABDIF_SIZE                                   0x1
#define _U2UIR_ABDIF_LENGTH                                 0x1
#define _U2UIR_ABDIF_MASK                                   0x40
#define _U2UIR_WUIF_POSN                                    0x7
#define _U2UIR_WUIF_POSITION                                0x7
#define _U2UIR_WUIF_SIZE                                    0x1
#define _U2UIR_WUIF_LENGTH                                  0x1
#define _U2UIR_WUIF_MASK                                    0x80
#define _U2UIR_U2ABDIE_POSN                                 0x2
#define _U2UIR_U2ABDIE_POSITION                             0x2
#define _U2UIR_U2ABDIE_SIZE                                 0x1
#define _U2UIR_U2ABDIE_LENGTH                               0x1
#define _U2UIR_U2ABDIE_MASK                                 0x4
#define _U2UIR_U2ABDIF_POSN                                 0x6
#define _U2UIR_U2ABDIF_POSITION                             0x6
#define _U2UIR_U2ABDIF_SIZE                                 0x1
#define _U2UIR_U2ABDIF_LENGTH                               0x1
#define _U2UIR_U2ABDIF_MASK                                 0x40
#define _U2UIR_U2WUIF_POSN                                  0x7
#define _U2UIR_U2WUIF_POSITION                              0x7
#define _U2UIR_U2WUIF_SIZE                                  0x1
#define _U2UIR_U2WUIF_LENGTH                                0x1
#define _U2UIR_U2WUIF_MASK                                  0x80

// Register: U2ERRIR
#define U2ERRIR U2ERRIR
extern volatile unsigned char           U2ERRIR             __at(0x2C5);
#ifndef _LIB_BUILD
asm("U2ERRIR equ 02C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U2TXCIF                :1;
        unsigned U2RXFOIF               :1;
        unsigned U2RXBKIF               :1;
        unsigned U2FERIF                :1;
        unsigned U2CERIF                :1;
        unsigned U2ABDOVF               :1;
        unsigned U2PERIF                :1;
        unsigned U2TXMTIF               :1;
    };
} U2ERRIRbits_t;
extern volatile U2ERRIRbits_t U2ERRIRbits __at(0x2C5);
// bitfield macros
#define _U2ERRIR_TXCIF_POSN                                 0x0
#define _U2ERRIR_TXCIF_POSITION                             0x0
#define _U2ERRIR_TXCIF_SIZE                                 0x1
#define _U2ERRIR_TXCIF_LENGTH                               0x1
#define _U2ERRIR_TXCIF_MASK                                 0x1
#define _U2ERRIR_RXFOIF_POSN                                0x1
#define _U2ERRIR_RXFOIF_POSITION                            0x1
#define _U2ERRIR_RXFOIF_SIZE                                0x1
#define _U2ERRIR_RXFOIF_LENGTH                              0x1
#define _U2ERRIR_RXFOIF_MASK                                0x2
#define _U2ERRIR_RXBKIF_POSN                                0x2
#define _U2ERRIR_RXBKIF_POSITION                            0x2
#define _U2ERRIR_RXBKIF_SIZE                                0x1
#define _U2ERRIR_RXBKIF_LENGTH                              0x1
#define _U2ERRIR_RXBKIF_MASK                                0x4
#define _U2ERRIR_FERIF_POSN                                 0x3
#define _U2ERRIR_FERIF_POSITION                             0x3
#define _U2ERRIR_FERIF_SIZE                                 0x1
#define _U2ERRIR_FERIF_LENGTH                               0x1
#define _U2ERRIR_FERIF_MASK                                 0x8
#define _U2ERRIR_CERIF_POSN                                 0x4
#define _U2ERRIR_CERIF_POSITION                             0x4
#define _U2ERRIR_CERIF_SIZE                                 0x1
#define _U2ERRIR_CERIF_LENGTH                               0x1
#define _U2ERRIR_CERIF_MASK                                 0x10
#define _U2ERRIR_ABDOVF_POSN                                0x5
#define _U2ERRIR_ABDOVF_POSITION                            0x5
#define _U2ERRIR_ABDOVF_SIZE                                0x1
#define _U2ERRIR_ABDOVF_LENGTH                              0x1
#define _U2ERRIR_ABDOVF_MASK                                0x20
#define _U2ERRIR_PERIF_POSN                                 0x6
#define _U2ERRIR_PERIF_POSITION                             0x6
#define _U2ERRIR_PERIF_SIZE                                 0x1
#define _U2ERRIR_PERIF_LENGTH                               0x1
#define _U2ERRIR_PERIF_MASK                                 0x40
#define _U2ERRIR_TXMTIF_POSN                                0x7
#define _U2ERRIR_TXMTIF_POSITION                            0x7
#define _U2ERRIR_TXMTIF_SIZE                                0x1
#define _U2ERRIR_TXMTIF_LENGTH                              0x1
#define _U2ERRIR_TXMTIF_MASK                                0x80
#define _U2ERRIR_U2TXCIF_POSN                               0x0
#define _U2ERRIR_U2TXCIF_POSITION                           0x0
#define _U2ERRIR_U2TXCIF_SIZE                               0x1
#define _U2ERRIR_U2TXCIF_LENGTH                             0x1
#define _U2ERRIR_U2TXCIF_MASK                               0x1
#define _U2ERRIR_U2RXFOIF_POSN                              0x1
#define _U2ERRIR_U2RXFOIF_POSITION                          0x1
#define _U2ERRIR_U2RXFOIF_SIZE                              0x1
#define _U2ERRIR_U2RXFOIF_LENGTH                            0x1
#define _U2ERRIR_U2RXFOIF_MASK                              0x2
#define _U2ERRIR_U2RXBKIF_POSN                              0x2
#define _U2ERRIR_U2RXBKIF_POSITION                          0x2
#define _U2ERRIR_U2RXBKIF_SIZE                              0x1
#define _U2ERRIR_U2RXBKIF_LENGTH                            0x1
#define _U2ERRIR_U2RXBKIF_MASK                              0x4
#define _U2ERRIR_U2FERIF_POSN                               0x3
#define _U2ERRIR_U2FERIF_POSITION                           0x3
#define _U2ERRIR_U2FERIF_SIZE                               0x1
#define _U2ERRIR_U2FERIF_LENGTH                             0x1
#define _U2ERRIR_U2FERIF_MASK                               0x8
#define _U2ERRIR_U2CERIF_POSN                               0x4
#define _U2ERRIR_U2CERIF_POSITION                           0x4
#define _U2ERRIR_U2CERIF_SIZE                               0x1
#define _U2ERRIR_U2CERIF_LENGTH                             0x1
#define _U2ERRIR_U2CERIF_MASK                               0x10
#define _U2ERRIR_U2ABDOVF_POSN                              0x5
#define _U2ERRIR_U2ABDOVF_POSITION                          0x5
#define _U2ERRIR_U2ABDOVF_SIZE                              0x1
#define _U2ERRIR_U2ABDOVF_LENGTH                            0x1
#define _U2ERRIR_U2ABDOVF_MASK                              0x20
#define _U2ERRIR_U2PERIF_POSN                               0x6
#define _U2ERRIR_U2PERIF_POSITION                           0x6
#define _U2ERRIR_U2PERIF_SIZE                               0x1
#define _U2ERRIR_U2PERIF_LENGTH                             0x1
#define _U2ERRIR_U2PERIF_MASK                               0x40
#define _U2ERRIR_U2TXMTIF_POSN                              0x7
#define _U2ERRIR_U2TXMTIF_POSITION                          0x7
#define _U2ERRIR_U2TXMTIF_SIZE                              0x1
#define _U2ERRIR_U2TXMTIF_LENGTH                            0x1
#define _U2ERRIR_U2TXMTIF_MASK                              0x80

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
extern volatile unsigned char           U2ERRIE             __at(0x2C6);
#ifndef _LIB_BUILD
asm("U2ERRIE equ 02C6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U2TXCIE                :1;
        unsigned U2RXFOIE               :1;
        unsigned U2RXBKIE               :1;
        unsigned U2FERIE                :1;
        unsigned U2CERIE                :1;
        unsigned U2ABDOVE               :1;
        unsigned U2PERIE                :1;
        unsigned U2TXMTIE               :1;
    };
} U2ERRIEbits_t;
