GopalSaraf/Practicals/PSDL/include/proc/pic18f15q40.h
extern volatile IVTADHbits_t IVTADHbits __at(0x45B);
// bitfield macros
#define _IVTADH_AD8_POSN                                    0x0
#define _IVTADH_AD8_POSITION                                0x0
#define _IVTADH_AD8_SIZE                                    0x1
#define _IVTADH_AD8_LENGTH                                  0x1
#define _IVTADH_AD8_MASK                                    0x1
#define _IVTADH_AD9_POSN                                    0x1
#define _IVTADH_AD9_POSITION                                0x1
#define _IVTADH_AD9_SIZE                                    0x1
#define _IVTADH_AD9_LENGTH                                  0x1
#define _IVTADH_AD9_MASK                                    0x2
#define _IVTADH_AD10_POSN                                   0x2
#define _IVTADH_AD10_POSITION                               0x2
#define _IVTADH_AD10_SIZE                                   0x1
#define _IVTADH_AD10_LENGTH                                 0x1
#define _IVTADH_AD10_MASK                                   0x4
#define _IVTADH_AD11_POSN                                   0x3
#define _IVTADH_AD11_POSITION                               0x3
#define _IVTADH_AD11_SIZE                                   0x1
#define _IVTADH_AD11_LENGTH                                 0x1
#define _IVTADH_AD11_MASK                                   0x8
#define _IVTADH_AD12_POSN                                   0x4
#define _IVTADH_AD12_POSITION                               0x4
#define _IVTADH_AD12_SIZE                                   0x1
#define _IVTADH_AD12_LENGTH                                 0x1
#define _IVTADH_AD12_MASK                                   0x10
#define _IVTADH_AD13_POSN                                   0x5
#define _IVTADH_AD13_POSITION                               0x5
#define _IVTADH_AD13_SIZE                                   0x1
#define _IVTADH_AD13_LENGTH                                 0x1
#define _IVTADH_AD13_MASK                                   0x20
#define _IVTADH_AD14_POSN                                   0x6
#define _IVTADH_AD14_POSITION                               0x6
#define _IVTADH_AD14_SIZE                                   0x1
#define _IVTADH_AD14_LENGTH                                 0x1
#define _IVTADH_AD14_MASK                                   0x40
#define _IVTADH_AD15_POSN                                   0x7
#define _IVTADH_AD15_POSITION                               0x7
#define _IVTADH_AD15_SIZE                                   0x1
#define _IVTADH_AD15_LENGTH                                 0x1
#define _IVTADH_AD15_MASK                                   0x80

// Register: IVTADU
#define IVTADU IVTADU
extern volatile unsigned char           IVTADU              __at(0x45C);
#ifndef _LIB_BUILD
asm("IVTADU equ 045Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD16                   :1;
        unsigned AD17                   :1;
        unsigned AD18                   :1;
        unsigned AD19                   :1;
        unsigned AD20                   :1;
    };
} IVTADUbits_t;
extern volatile IVTADUbits_t IVTADUbits __at(0x45C);
// bitfield macros
#define _IVTADU_AD16_POSN                                   0x0
#define _IVTADU_AD16_POSITION                               0x0
#define _IVTADU_AD16_SIZE                                   0x1
#define _IVTADU_AD16_LENGTH                                 0x1
#define _IVTADU_AD16_MASK                                   0x1
#define _IVTADU_AD17_POSN                                   0x1
#define _IVTADU_AD17_POSITION                               0x1
#define _IVTADU_AD17_SIZE                                   0x1
#define _IVTADU_AD17_LENGTH                                 0x1
#define _IVTADU_AD17_MASK                                   0x2
#define _IVTADU_AD18_POSN                                   0x2
#define _IVTADU_AD18_POSITION                               0x2
#define _IVTADU_AD18_SIZE                                   0x1
#define _IVTADU_AD18_LENGTH                                 0x1
#define _IVTADU_AD18_MASK                                   0x4
#define _IVTADU_AD19_POSN                                   0x3
#define _IVTADU_AD19_POSITION                               0x3
#define _IVTADU_AD19_SIZE                                   0x1
#define _IVTADU_AD19_LENGTH                                 0x1
#define _IVTADU_AD19_MASK                                   0x8
#define _IVTADU_AD20_POSN                                   0x4
#define _IVTADU_AD20_POSITION                               0x4
#define _IVTADU_AD20_SIZE                                   0x1
#define _IVTADU_AD20_LENGTH                                 0x1
#define _IVTADU_AD20_MASK                                   0x10

// Register: IVTBASE
#define IVTBASE IVTBASE
#ifndef __CCI__
extern volatile __uint24                IVTBASE             __at(0x45D);
#endif
#ifndef _LIB_BUILD
asm("IVTBASE equ 045Dh");
#endif

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
extern volatile unsigned char           IVTBASEL            __at(0x45D);
#ifndef _LIB_BUILD
asm("IVTBASEL equ 045Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE0                  :1;
        unsigned BASE1                  :1;
        unsigned BASE2                  :1;
        unsigned BASE3                  :1;
        unsigned BASE4                  :1;
        unsigned BASE5                  :1;
        unsigned BASE6                  :1;
        unsigned BASE7                  :1;
    };
} IVTBASELbits_t;
extern volatile IVTBASELbits_t IVTBASELbits __at(0x45D);
// bitfield macros
#define _IVTBASEL_BASE0_POSN                                0x0
#define _IVTBASEL_BASE0_POSITION                            0x0
#define _IVTBASEL_BASE0_SIZE                                0x1
#define _IVTBASEL_BASE0_LENGTH                              0x1
#define _IVTBASEL_BASE0_MASK                                0x1
#define _IVTBASEL_BASE1_POSN                                0x1
#define _IVTBASEL_BASE1_POSITION                            0x1
#define _IVTBASEL_BASE1_SIZE                                0x1
#define _IVTBASEL_BASE1_LENGTH                              0x1
#define _IVTBASEL_BASE1_MASK                                0x2
#define _IVTBASEL_BASE2_POSN                                0x2
#define _IVTBASEL_BASE2_POSITION                            0x2
#define _IVTBASEL_BASE2_SIZE                                0x1
#define _IVTBASEL_BASE2_LENGTH                              0x1
#define _IVTBASEL_BASE2_MASK                                0x4
#define _IVTBASEL_BASE3_POSN                                0x3
#define _IVTBASEL_BASE3_POSITION                            0x3
#define _IVTBASEL_BASE3_SIZE                                0x1
#define _IVTBASEL_BASE3_LENGTH                              0x1
#define _IVTBASEL_BASE3_MASK                                0x8
#define _IVTBASEL_BASE4_POSN                                0x4
#define _IVTBASEL_BASE4_POSITION                            0x4
#define _IVTBASEL_BASE4_SIZE                                0x1
#define _IVTBASEL_BASE4_LENGTH                              0x1
#define _IVTBASEL_BASE4_MASK                                0x10
#define _IVTBASEL_BASE5_POSN                                0x5
#define _IVTBASEL_BASE5_POSITION                            0x5
#define _IVTBASEL_BASE5_SIZE                                0x1
#define _IVTBASEL_BASE5_LENGTH                              0x1
#define _IVTBASEL_BASE5_MASK                                0x20
#define _IVTBASEL_BASE6_POSN                                0x6
#define _IVTBASEL_BASE6_POSITION                            0x6
#define _IVTBASEL_BASE6_SIZE                                0x1
#define _IVTBASEL_BASE6_LENGTH                              0x1
#define _IVTBASEL_BASE6_MASK                                0x40
#define _IVTBASEL_BASE7_POSN                                0x7
#define _IVTBASEL_BASE7_POSITION                            0x7
#define _IVTBASEL_BASE7_SIZE                                0x1
#define _IVTBASEL_BASE7_LENGTH                              0x1
#define _IVTBASEL_BASE7_MASK                                0x80

